#include <avr/io.h> 
#include <util/delay.h>  // библиотека задержек
#define F_CPU 1000000UL  // определяем тактовую частоту микроконтроллера (зависит от выбранного микроконтроллера)
#define T 3

int chisla [10] = {
	0b00111111, //0
	0b00000110, //1
	0b01011011, //2
	0b01001111, //3
	0b01100110, //4
	0b01101101, //5
	0b01111101, //6
	0b00000111, //7
	0b01111111, //8
	0b01101111, //9
};

int main(void)
{
	DDRD = 0b11111111; // PORDD - отвечает за то, что написано в одном разряде
	PORTD = 0b00000110; // с подачей напряжения будет загораться цифра 1
	
	DDRB = 0b00001111; // PORDB - отвечает за разряд (1, 2, 3 или 4)
	PORTB = 0b00000001; // при подаче напряжения сразу будет гореть первый разряд индикатора
		
	while (1)
	{
		PORTB = 0b00000001; PORTD = chisla[1]; // на первом разряде вывод цифры 1
		_delay_ms(T);
		PORTB = 0b00000010; PORTD = chisla[3]; // на втором разряде вывод цифры 3
		_delay_ms(T);
		PORTB = 0b00000100; PORTD = chisla[0]; // на третьем разряде вывод цифры 0
		_delay_ms(T);
		PORTB = 0b00001000; PORTD = chisla[7]; // на чётвертом разряде вывод цифры 7
		_delay_ms(T);
	}
}